Repository: neokapi/neokapi
Catalog: l10n/tm/cli-nb.tmx
Source language: en
Languages: nb

source: Run a composed flow that chains multiple tools together. Flows are multi-tool pipelines. For single-tool operations, use the tool directly (e.g. "kapi ai-translate" instead of "kapi run ai-translate"). Built-in flows: ai-translate-qa Translate + quality check using AI/LLM Custom flows can be defined in .kapi project files or .bowrain/flows/ as YAML files. Use -p to run a flow from a .kapi project file: kapi run translate -p myproject.kapi
nb: Kjør en sammensatt flyt som lenker flere verktøy sammen. Flyter er pipeliner med flere verktøy. For operasjoner med ett verktøy, bruk verktøyet direkte (f.eks. "kapi ai-translate" i stedet for "kapi run ai-translate"). Innebygde flyter: ai-translate-qa Oversett + kvalitetskontroll med AI/LLM Egendefinerte flyter kan defineres i .kapi-prosjektfiler eller .bowrain/flows/ som YAML-filer. Bruk -p for å kjøre en flyt fra en .kapi-prosjektfil: kapi run translate -p myproject.kapi

source: Run a localization project's bound quality gates in a single shot and return a single structured pass/fail plus actionable findings. Gates (each runs only when the project binds the resource it needs): brand If a brand voice is bound (defaults.brand_voice), score the source-language content against it. Fails when the score is below the threshold (default 80, override with --min-score). terminology If a termbase is bound (defaults.termbase), check that target files use the required translations from the project glossary. qa For translated target files, check placeholder/tag integrity against the source and flag untranslated/empty targets. With no file arguments, verify inspects the project's content: brand on the source files, terminology and QA on the target files derived from each content item's target template and the project target languages. Pass file paths to verify just those files instead. Exit codes: 0 pass, 3 when any gate fails, 1 for operational errors. Exit 3 means "not on-spec yet", not a crash — in an assistant fix-loop, read the findings and fix. Pass --no-fail to always exit 0 (report mode) when looping; omit it for CI gating.
nb: Kjør kvalitetsportene som er bundet til et lokaliseringsprosjekt i én operasjon, og få ett strukturert bestått/ikke bestått pluss funn som kan handles på. Porter (hver kjører bare når prosjektet binder ressursen den trenger): brand Hvis en merkevarestemme er bundet (defaults.brand_voice), vurderes innholdet på kildespråket mot den. Feiler når poengsummen er under terskelen (standard 80, overstyr med --min-score). terminology Hvis en termbase er bundet (defaults.termbase), kontrolleres det at målfilene bruker de påkrevde oversettelsene fra prosjektets ordliste. qa For oversatte målfiler kontrolleres plassholder-/tagg-integritet mot kilden, og uoversatte/tomme mål flagges. Uten filargumenter inspiserer verify prosjektets innhold: brand på kildefilene, terminology og qa på målfilene avledet fra hvert innholdselements målmal og prosjektets målspråk. Oppgi filstier for å verifisere bare de filene i stedet. Avslutningskoder: 0 bestått, 3 når en port feiler, 1 for operasjonelle feil. Kode 3 betyr "ikke i henhold til spesifikasjonen ennå", ikke krasj — i en fikse-løkke med en assistent, les funnene og rett dem. Bruk --no-fail for alltid å avslutte med 0 (rapportmodus) i løkker; utelat flagget i CI slik at porten gjelder.

source: Run a project's bound quality gates (brand, terminology, QA) in one shot
nb: Kjør prosjektets bundne kvalitetsporter (merkevare, terminologi, QA) i én operasjon

source: Run content checks over a file like tests over code (do-not-translate, placeholders, terminology, brand)
nb: Kjør innholdskontroller over en fil som tester over kode (do-not-translate, plassholdere, terminologi, merkevare)

source: Run content checks over a file — or a source/target pair — and return structured findings plus a pass/fail, gating on severity. With two files, the second is the translated target and the bilingual checks run: do-not-translate (terms that must survive verbatim) and placeholder/tag integrity. With one file, source-side checks run (brand vocabulary). A bound brand profile (--profile/--pack/--profile-file) adds vocabulary checks in either mode. Exit codes: 0 pass, 3 when the gate fails (a critical finding by default), 1 for operational errors. Pass --no-fail to always exit 0 (report mode) in a fix-loop.
nb: Kjør innholdskontroller over en fil — eller et kilde/mål-par — og få strukturerte funn pluss bestått/ikke bestått, med port på alvorlighetsgrad. Med to filer er den andre det oversatte målet, og de tospråklige kontrollene kjøres: do-not-translate (termer som må overleve ordrett) og plassholder-/tagg-integritet. Med én fil kjøres kontrollene på kildesiden (merkevarevokabular). En bundet merkevareprofil (--profile/--pack/--profile-file) legger til vokabularkontroller i begge modi. Avslutningskoder: 0 bestått, 3 når porten feiler (et kritisk funn som standard), 1 for operasjonelle feil. Bruk --no-fail for alltid å avslutte med 0 (rapportmodus) i en fikse-løkke.

source: SOURCE
nb: KILDE

source: Save a named AI provider credential
nb: Lagre navngitt legitimasjon for en AI-leverandør

source: Save an AI provider credential to the OS keychain. The credential name is used to reference it in flows and tool commands: kapi ai-translate --credential my-openai -i file.json --target-lang fr If only one credential is saved, tools will auto-detect it without --credential.
nb: Lagre legitimasjon for en AI-leverandør i operativsystemets nøkkelring. Navnet på legitimasjonen brukes til å referere til den i flyter og verktøykommandoer: kapi ai-translate --credential my-openai -i file.json --target-lang fr Hvis bare én legitimasjon er lagret, finner verktøyene den automatisk uten --credential.

source: Scaffold a brand voice profile YAML to fill in (optionally seeded from a starter pack)
nb: Lag et utkast til merkevarestemmeprofil i YAML (eventuelt basert på en startpakke)

source: Scaffold a new kapi project in the current directory
nb: Opprett et nytt kapi-prosjekt i gjeldende katalog

source: Score text against a brand voice profile
nb: Vurder tekst mot en merkevarestemmeprofil

source: Search concepts in the termbase
nb: Søk etter begreper i termbasen

source: Search the registry for plugins
nb: Søk etter tillegg i registeret

source: Search the translatable text of files (use kgrep)
nb: Søk i den oversettbare teksten i filer (bruk kgrep)

source: Search translation memory entries
nb: Søk i oversettelsesminnets enheter

source: Show a .klz workspace's state (dirty?)
nb: Vis tilstanden til et .klz-arbeidsområde (endret?)

source: Show a brand voice profile as a guide
nb: Vis en merkevarestemmeprofil som guide

source: Show detailed configuration for a preset. Accepts a bare preset name (searched across all formats) or the qualified format:preset syntax (e.g. okf_xml:AndroidStrings).
nb: Vis detaljert konfigurasjon for en forhåndsinnstilling. Godtar et rent forhåndsinnstillingsnavn (søkes på tvers av alle formater) eller den kvalifiserte format:preset-syntaksen (f.eks. okf_xml:AndroidStrings).

source: Show detailed information about a format
nb: Vis detaljert informasjon om et format

source: Show details for a single import session
nb: Vis detaljer for én importøkt

source: Show details for an installed plugin
nb: Vis detaljer for et installert tillegg

source: Show every TM entry written (or updated) by a specific kapi merge batch, so you can see what a particular return from a translator contributed to the project TM. Origin provenance is stamped by kapi merge (source="merge", reference=<batch-id>, key=<source-rel>). Audit iterates the project TM, surfaces only TUs with at least one matching Origin, and prints source file, block hash, timestamp, and the originating XLIFF filename. Examples: kapi tm audit --batch <batch-id> # full listing kapi tm audit --batch <batch-id> --limit 50 # cap rows Use "kapi tm stats" for global TM metrics (entry counts, per-locale breakdown). Audit is narrow by design — it answers "what did this merge do?".
nb: Vis hver TM-enhet som ble skrevet (eller oppdatert) av en bestemt kapi merge-bunt, slik at du kan se hva en bestemt retur fra en oversetter bidro med til prosjektets oversettelsesminne. Opphavsproveniens stemples av kapi merge (source="merge", reference=<batch-id>, key=<source-rel>). Audit itererer over prosjektets TM, viser bare TU-er med minst ett samsvarende opphav, og skriver ut kildefil, blokkhasj, tidsstempel og navnet på XLIFF-filen som var opphavet. Eksempler: kapi tm audit --batch <batch-id> # full listing kapi tm audit --batch <batch-id> --limit 50 # begrens antall rader Bruk "kapi tm stats" for globale TM-måltall (antall enheter, fordeling per språk). Audit er smal med hensikt — den svarer på "hva gjorde denne flettingen?".

source: Show preset details
nb: Vis detaljer for en forhåndsinnstilling

source: Show termbase statistics
nb: Vis termbasestatistikk

source: Show translation memory statistics
nb: Vis statistikk for oversettelsesminnet

source: Show version information
nb: Vis versjonsinformasjon

source: Snapshot a .kapi project's working state into a .klz
nb: Ta øyeblikksbilde av arbeidstilstanden i et .kapi-prosjekt til en .klz

source: Snapshot a .kapi project's working state — the block-store overlays, the authoritative translation memory, and the termbase — into a portable .klz. Regenerable caches and secrets are excluded. Move the snapshot to another machine and "kapi unpack" it to resume work there.
nb: Ta et øyeblikksbilde av arbeidstilstanden i et .kapi-prosjekt — blokklagerets overlegg, det autoritative oversettelsesminnet og termbasen — til en portabel .klz. Regenererbare hurtigbuffere og hemmeligheter utelates. Flytt øyeblikksbildet til en annen maskin og kjør "kapi unpack" der for å fortsette arbeidet.

source: Start MCP server (stdio) exposing project tools
nb: Start MCP-server (stdio) som eksponerer prosjektverktøy

source: Stop tracking files matching the given patterns. If a pattern matches one added with 'kapi add', the mapping is removed. Otherwise the pattern is added to the exclude list so those files are skipped. kapi rm "src/**/*.html" # remove the mapping kapi rm "src/legacy/*.html" # exclude matching files
nb: Slutt å spore filer som matcher de angitte mønstrene. Hvis et mønster matcher ett som ble lagt til med 'kapi add', fjernes kartleggingen. Ellers legges mønsteret til i ekskluderingslisten slik at de filene hoppes over. kapi rm "src/**/*.html" # fjern kartleggingen kapi rm "src/legacy/*.html" # ekskluder samsvarende filer

source: Stream-edit the translatable text of files (use ksed)
nb: Strømrediger den oversettbare teksten i filer (bruk ksed)

source: Test that a credential's API key is accessible
nb: Test at API-nøkkelen til en legitimasjon er tilgjengelig

source: Text Processing
nb: Tekstbehandling

source: Total: %d flow(s)
nb: Totalt: %d flyt(er)

source: Total: %d format(s)
nb: Totalt: %d format(er)

source: Total: %d plugin(s)
nb: Totalt: %d tillegg

source: Total: %d registry(ies)
nb: Totalt: %d register(re)

source: Total: %d tool(s)
nb: Totalt: %d verktøy

source: Trace TM entries by merge batch id
nb: Spor TM-enheter etter flettebunt-id

source: Update an installed plugin in place using the channel and constraint recorded at install time. Pass --channel or --constraint to switch tracks during update; --index points the update at a different registry index URL. Examples: kapi plugin update bowrain kapi plugin update bowrain --channel beta kapi plugin update bowrain --constraint ^2.0
nb: Oppdater et installert tillegg på stedet med kanalen og versjonskravet som ble registrert ved installasjon. Bruk --channel eller --constraint for å bytte spor under oppdateringen; --index peker oppdateringen mot en annen registerindeks-URL. Eksempler: kapi plugin update bowrain kapi plugin update bowrain --channel beta kapi plugin update bowrain --constraint ^2.0

source: Update an installed plugin to the latest matching version
nb: Oppdater et installert tillegg til nyeste samsvarende versjon

source: VERSION
nb: VERSJON

source: WRITE
nb: SKRIV

source: Walk a directory and import every matching TMX file into the TM. Auto-detects plain .tmx and gzipped .tmx.gz files. The filename (without path) becomes the Origin.Key on each imported entry so you can trace which file a segment came from. By default, imports entries matching --source-locale and --target-locale from every file. Use --pattern to filter (glob against filename) and --all-pairs to emit the full language cross-product from multilingual files. Examples: kapi tm import-dir ./tmx --name corpus --source-locale en --target-locale nb --pattern "*en-nb*" kapi tm import-dir ./eurlex --name corpus --all-pairs --locales en-GB,fr-FR,de-DE
nb: Gå gjennom en katalog og importer hver samsvarende TMX-fil til oversettelsesminnet. Gjenkjenner rene .tmx- og gzip-komprimerte .tmx.gz-filer automatisk. Filnavnet (uten sti) blir Origin.Key på hver importert enhet, slik at du kan spore hvilken fil et segment kom fra. Som standard importeres enheter som samsvarer med --source-locale og --target-locale fra hver fil. Bruk --pattern for å filtrere (glob mot filnavn) og --all-pairs for å skrive hele språkkryssproduktet fra flerspråklige filer. Eksempler: kapi tm import-dir ./tmx --name corpus --source-locale en --target-locale nb --pattern "*en-nb*" kapi tm import-dir ./eurlex --name corpus --all-pairs --locales en-GB,fr-FR,de-DE

source: Write a brand voice profile YAML to fill in. With no flags, emits a commented template. With --pack, emits an existing starter pack as an editable base. An AI assistant can fill this in from what it already knows about the product, from sample content, or from a linked website, then `kapi brand import` it.
nb: Skriv ut en merkevarestemmeprofil i YAML som kan fylles inn. Uten flagg skrives en kommentert mal. Med --pack skrives en eksisterende startpakke som redigerbart utgangspunkt. En AI-assistent kan fylle den inn fra det den allerede vet om produktet, fra innholdseksempler eller fra et lenket nettsted, og deretter importere den med `kapi brand import`.

source: kapi helps you manage multilingual content — convert document formats, translate with AI, and run quality checks across a wide range of file types.
nb: kapi hjelper deg å håndtere flerspråklig innhold — konverter dokumentformater, oversett med AI og kjør kvalitetskontroller på et bredt utvalg filtyper.
